_logs/global.log


2019-03-06 18:10:19,104 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.s.j.s.SoapServicePublisher:19 - Published the SOAP service at: http://localhost:8081/JaxWsSoapService?wsdl
2019-03-06 18:10:19,114 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:19 - Making the SOAP call using stubs.
2019-03-06 18:10:19,235 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:10:19,256 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:30 - helloWorldResponse: Hello world!
2019-03-06 18:10:19,258 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello Mike
2019-03-06 18:10:19,260 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:32 - sayHelloResponse: Hello Mike
2019-03-06 18:10:19,261 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:22 - Making the SOAP call using a generic SOAP connection and the ObjectFactory stub.
2019-03-06 18:10:19,342 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HelloWorld xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:10:19,367 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:10:19,369 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorldResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello world!</return></ns2:HelloWorldResponse></S:Body></S:Envelope>
2019-03-06 18:10:19,371 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><sayHello xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:10:19,375 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello null
2019-03-06 18:10:19,379 [RMI TCP Connection(5)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:sayHelloResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello null</return></ns2:sayHelloResponse></S:Body></S:Envelope>
2019-03-06 18:14:28,939 [ContainerBackgroundProcessor[StandardEngine[Catalina]]] INFO  c.g.soap.jaxws.client.SoapClient:19 - Making the SOAP call using stubs.
2019-03-06 18:15:51,772 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.s.j.s.SoapServicePublisher:19 - Published the SOAP service at: http://localhost:8081/JaxWsSoapService?wsdl
2019-03-06 18:15:51,781 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:19 - Making the SOAP call using stubs.
2019-03-06 18:15:51,892 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:15:51,896 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:30 - helloWorldResponse: Hello world!
2019-03-06 18:15:51,898 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello Mike
2019-03-06 18:15:51,900 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:32 - sayHelloResponse: Hello Mike
2019-03-06 18:15:51,901 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:22 - Making the SOAP call using a generic SOAP connection and the ObjectFactory stub.
2019-03-06 18:15:51,950 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HelloWorld xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:15:51,961 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:15:51,964 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorldResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello world!</return></ns2:HelloWorldResponse></S:Body></S:Envelope>
2019-03-06 18:15:51,965 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><sayHello xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:15:51,968 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello null
2019-03-06 18:15:51,969 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:sayHelloResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello null</return></ns2:sayHelloResponse></S:Body></S:Envelope>
2019-03-06 18:16:51,685 [http-nio-8080-exec-8] INFO  c.g.r.jersey.service.JerseyService:15 - Jersey REST service published at: http://localhost:8080/rest/message
2019-03-06 18:17:58,148 [http-nio-8080-exec-1] INFO  c.g.r.jersey.service.JerseyService:15 - Jersey REST service published at: http://localhost:8080/rest/message
2019-03-06 18:30:57,147 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.s.j.s.SoapServicePublisher:19 - Published the SOAP service at: http://localhost:8081/JaxWsSoapService?wsdl
2019-03-06 18:30:57,156 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:19 - Making the SOAP call using stubs.
2019-03-06 18:30:57,782 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:30:57,788 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:30 - helloWorldResponse: Hello world!
2019-03-06 18:30:57,792 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello Mike
2019-03-06 18:30:57,794 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:32 - sayHelloResponse: Hello Mike
2019-03-06 18:30:57,794 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:22 - Making the SOAP call using a generic SOAP connection and the ObjectFactory stub.
2019-03-06 18:30:57,847 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><HelloWorld xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:30:57,862 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:18 - Message: Hello world!
2019-03-06 18:30:57,864 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:HelloWorldResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello world!</return></ns2:HelloWorldResponse></S:Body></S:Envelope>
2019-03-06 18:30:57,865 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><sayHello xmlns="http://contract.service.jaxws.soap.giophub.com/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>
2019-03-06 18:30:57,869 [pool-1-thread-1] INFO  c.g.s.jaxws.service.SoapServiceImpl:25 - Message: Hello null
2019-03-06 18:30:57,871 [RMI TCP Connection(3)-127.0.0.1] INFO  c.g.soap.jaxws.client.SoapClient:85 - <?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:sayHelloResponse xmlns:ns2="http://contract.service.jaxws.soap.giophub.com/"><return>Hello null</return></ns2:sayHelloResponse></S:Body></S:Envelope>
2019-03-06 18:31:16,336 [http-nio-8080-exec-7] INFO  c.g.r.jersey.service.JerseyService:17 - Jersey REST service published at: http://localhost:8080/rest/jersey-service
